# Дано вещественное число A. Вычислите f (A), если f (x) = x2 + 4x + 5, при x ≤ 2;
# в случае ожидания f (x) = 1 / (x2 + 4x + 5).
a =  float ( input ( " Введите число А " ))
х = а
если х <=  2 :
    fx = x ** 2  +  4 * x +  5
    print ( " x <= 2; f (a) = " , fx)
еще :
    fx =  1  / (x ** 2  +  4 * x +  5 )
    print ( " x> 2; f (a) = " , fx)
