# Дано вещественное число A. Вычислите f (A), если f (x) = 0, при x ≤ 0; f (x) = x при 0 <x <1,
# в случае ожидания f (x) = x4.
импорт математики
a =  float ( input ( " Введите число А " ))
х = а
если х <=  0 :
    FX =  0
    print ( " x <= 2; f (a) = " , fx)
элиф  0  < х <  1 :
    FX = X
    print ( " 0 <x <1; f (a) = " , fx)
еще :
    fx = math.pow (x, 4 )
    print ( " x> = 1; f (a) = " , fx)
