# Дано натуральное число. Число: чётным, кратным 4.
num =  input ( " Введите число для проверки " ,)
num =  int (num)
если num %  2  ==  0  и num %  4  ==  0 :
    print ( « Число » , num, « четно и кратно 4 » )
еще :
    print ( " Число не соответствует условию " )
